/*==============================================================================*/
/* Goal Judgement C File							*/
/*==============================================================================*/

/*------------------------------------------------------------------------------*/
/* Include Files								*/
/*------------------------------------------------------------------------------*/
#include "wall_exist_judgement.h"
#include "goal_judgement.h"

/*------------------------------------------------------------------------------*/
/* Function　Definitions							*/
/*------------------------------------------------------------------------------*/

/*==============================================================================*/
/* ゴール検知				                                        */
/* 										*/
/* 3方の壁の有無から、ゴールを判定する						*/
/* ---------------------------------------------------------------------------- */
/*  Arguments:		existence_front_Wall	前壁有無		       	*/
/*  			existence_left_wall	左壁有無			*/
/*  			existence_right_wall	右壁有無			*/
/*  Return   :         	goal_judgment_result	ゴール判定結果			*/
/*			(GOAL / NO_GOAL)				        */
/*==============================================================================*/
int judgement_goal(int existence_front_wall, int existence_left_wall, int existence_right_wall)
{
	int goal_judgement_result = NO_GOAL;	// 初期値は"ゴールでない"に設定
	
	return goal_judgement_result;
}