/*==============================================================================*/
/* Switch Driver Header File							*/
/*==============================================================================*/
#ifndef _SWITCH_DRIVER_H
#define _SWITCH_DRIVER_H

/*------------------------------------------------------------------------------*/
/* Defines									*/
/*------------------------------------------------------------------------------*/
/* モード選択スイッチ種別 */
#define MODE_SW_RED	(0)			// 左スイッチ	(赤)
#define MODE_SW_YELLOW	(1)			// 中央スイッチ	(黄)
#define MODE_SW_BLUE	(2)			// 右スイッチ	(青)

/* モード選択スイッチ状態 */
#define SW_LEFT		(PORT3.PIDR.BIT.B1)	// 左スイッチ	(赤)
#define SW_CENTER	(PORTC.PIDR.BIT.B3)	// 中央スイッチ	(黄)
#define SW_RIGHT	(PORTC.PIDR.BIT.B2)	// 右スイッチ	(青)

/* スイッチ状態 */
#define SW_OFF		(1)			// スイッチがOFFの時に取る値
#define SW_ON		(0)			// スイッチがONの時に取る値

/* スイッチ制御用定義 */
#define CHATTERING_WAIT	(50)			// チャタリング回避用待ち時間

/*------------------------------------------------------------------------------*/
/* Function Prototype								*/
/*------------------------------------------------------------------------------*/
int get_switch_state(int switch_kind);		// スイッチ状態取得

#endif