/*==============================================================================*/
/* Scheduler C File								*/
/*==============================================================================*/

/*------------------------------------------------------------------------------*/
/* Include Files								*/
/*------------------------------------------------------------------------------*/
#include "recognition_module.h"
#include "judgement_module.h"
#include "control_module.h"
#include "tire_control.h"
#include "motor_driver.h"
#include "scheduler.h"

/*------------------------------------------------------------------------------*/
/* Function Definitions								*/
/*------------------------------------------------------------------------------*/

/*==============================================================================*/
/* 定期処理						                        */
/* 										*/
/* ソフトウェアのタスクを実行する						*/
/* ---------------------------------------------------------------------------- */
/*  Arguments:		-							*/
/*  Return   :         	-							*/
/*==============================================================================*/
void task_routine(void)
{
	/* まずは、スタート位置から0.5区画進む */
	run_straight(HALF_SECTION, DEFAULT_SPEED);
	
	/* 認知 */
	// マップ情報は固定のため処理なし

	/* 判断 */
	judgement();	// 走行経路を判断する
		
	/* 制御 */
	control();	// 走行経路に従って走行制御する
	
	/* ゴール */
	run_straight(HALF_SECTION, MIN_SPEED);		// 0.5区画直進する（ゴールに向かって減速する）
	
	return;
}