/*==============================================================================*/
/* Maze Setting Header File							*/
/*==============================================================================*/
#ifndef MAZE_SETTING_H
#define MAZE_SETTING_H

/*------------------------------------------------------------------------------*/
/* Defines									*/
/*------------------------------------------------------------------------------*/
/* ゴール座標 */
#define GOAL_X		(3)	// ゴール位置のX座標
#define GOAL_Y		(1)	// ゴール位置のY座標

/* 迷路情報 */
#define MAZESIZE_X	(6)	// 迷路の大きさ(MAZESIZE_X * MAZESIZE_Y)迷路
#define MAZESIZE_Y	(6)	// 迷路の大きさ(MAZESIZE_X * MAZESIZE_Y)迷路

#endif