/*==============================================================================*/
/* State Draw Map C File							*/
/*==============================================================================*/

/*------------------------------------------------------------------------------*/
/* Include Files								*/
/*------------------------------------------------------------------------------*/
#include "Application/Judgement/maze_setting.h"
#include "Application/Judgement/wall_exist_judgement.h"
#include "Application/Judgement/run_info_judgement.h"
#include "Application/Judgement/state_draw_map.h"

/*------------------------------------------------------------------------------*/
/* Global Variable								*/
/*------------------------------------------------------------------------------*/
eRunInfoType draw_map_run_info;			// マップ作成走行指示情報
stWallType wall_info[MAZESIZE_X][MAZESIZE_Y];	// マップ壁情報

/*------------------------------------------------------------------------------*/
/* Static Variable								*/
/*------------------------------------------------------------------------------*/
static int my_pos_x;		// 車体座標x
static int my_pos_y;		// 車体座標y
static eDirectionType my_direction;	// 車体の向き

/*------------------------------------------------------------------------------*/
/* Function prototype								*/
/*------------------------------------------------------------------------------*/
static void draw_map_step(void);

/*------------------------------------------------------------------------------*/
/* Function Definitions								*/
/*------------------------------------------------------------------------------*/

/*==============================================================================*/
/* マップ作成走行初期化								*/
/* ---------------------------------------------------------------------------- */
/*  入力:		-							*/
/*  出力:		-							*/
/*==============================================================================*/
void init_draw_map(void)
{
	int x, y;

	draw_map_run_info = Stop;

	// 初期位置：(0,0) 北向き
	my_pos_x = 0;
	my_pos_y = 0;
	my_direction = North;

	// まず全て壁有としておく
	for(x = 0; x < MAZESIZE_X; x++)
	{
		for(y = 0; y < MAZESIZE_Y; y++)
		{
			wall_info[my_pos_x][my_pos_y].north = WALL;
			wall_info[my_pos_x][my_pos_y].east = WALL;
			wall_info[my_pos_x][my_pos_y].south = WALL;
			wall_info[my_pos_x][my_pos_y].west = WALL;
		}
	}

	return;
}

/*==============================================================================*/
/* マップ作成走行								*/
/*										*/
/* マップ全体の壁情報を記憶し、スタート地点に戻って止まる			*/
/* ---------------------------------------------------------------------------- */
/*  入力:		existence_front_wall	前壁有無			*/
/*			existence_left_wall	左壁有無			*/
/*			existence_right_wall	右壁有無			*/
/*  出力:		draw_map_run_info	マップ作成走行指示情報		*/
/*			wall_info		マップ壁情報			*/
/*==============================================================================*/
void draw_map(void)
{
	if( (my_pos_x == 0) && (my_pos_y == 0) && (my_direction == North))
	{
		// はじめの一歩(0,0で北向き)は上に半マス進む
		my_pos_y = 1;
		draw_map_run_info = Half;
	}
	else if( (my_pos_x == 0) && (my_pos_y == 0) && (my_direction != North))
	{
		// 以降、スタート地点に戻ってきたらマップ作成完了で停止
		draw_map_run_info = Stop;
	}
	else
	{
		// それ以外の場合、壁情報を記憶しながら進む
		draw_map_step();
	}

	return;
}

/*==============================================================================*/
/* マップ作成走行指示								*/
/*										*/
/* マップ全体の壁情報を記憶できるように、壁情報を記憶しながら進行方向を決定する	*/
/* ---------------------------------------------------------------------------- */
/*  入力:		existence_front_wall	前壁有無			*/
/*			existence_left_wall	左壁有無			*/
/*			existence_right_wall	右壁有無			*/
/*  出力:		draw_map_run_info	マップ作成走行指示情報		*/
/*			wall_info		マップ壁情報			*/
/*==============================================================================*/
void draw_map_step(void)
{
}
