/*==============================================================================*/
/* Run Info Judgement C File							*/
/*==============================================================================*/

/*------------------------------------------------------------------------------*/
/* Include Files								*/
/*------------------------------------------------------------------------------*/
#include "Application/Judgement/goal_judgement.h"
#include "Application/Judgement/wall_exist_judgement.h"
#include "Application/Judgement/run_info_judgement.h"

/*------------------------------------------------------------------------------*/
/* Defines									*/
/*------------------------------------------------------------------------------*/
#define RUN_STATE_INIT      (0)  // 初期状態
#define RUN_STATE_STEADY    (1)  // 定常状態

/*------------------------------------------------------------------------------*/
/* Global Variable								*/
/*------------------------------------------------------------------------------*/
eRunInfoType run_info;		// 走行指示情報

/*------------------------------------------------------------------------------*/
/* Variable                                                                     */
/*------------------------------------------------------------------------------*/
static int run_state;		// 動作状態

/*------------------------------------------------------------------------------*/
/* Function Definitions								*/
/*------------------------------------------------------------------------------*/

/*==============================================================================*/
/*  走行動作状態初期化								*/
/* ---------------------------------------------------------------------------- */
/*  入力:		-							*/
/*  出力:		-							*/
/*==============================================================================*/
void init_run_info_judgement(void)
{
	run_info = Stop;
	run_state = RUN_STATE_INIT;

	return;
}

/*==============================================================================*/
/*  走行指示情報決定								*/
/* 										*/
/*  進行方向を決定する								*/
/* ---------------------------------------------------------------------------- */
/*  入力:		-							*/
/*  出力:		run_info		走行指示情報			*/
/*==============================================================================*/
void judgement_run_info(void)
{
	// 起動直後0.5マス進む
	if(run_state == RUN_STATE_INIT)
	{
		run_info = Half;
		run_state = RUN_STATE_STEADY;
		return;
	}

	// ゴール到達時停止
	if(goal_judgement_result == GOAL)
	{
		run_info = Stop;
		return;
	}

	// 左手法制御
	if(existence_left_wall == NO_WALL)		// 左に壁が無いなら左旋回
	{
		run_info = TurnLeft;
	}
	else if(existence_front_wall == NO_WALL)	// 前に壁が無いなら前進
	{
		run_info = Forward;
	}
	else if(existence_right_wall == NO_WALL)	// 右に壁が無いなら右旋回
	{
		run_info = TurnRight;
	}
	else						// 3方向のいずれにも壁が有る場合は反転
	{
		run_info = Reverse;
	}
	
	return;
}
