/*==============================================================================*/
/* Interrupt Header File							*/
/*==============================================================================*/
#ifndef _INTERRUPT_H
#define _INTERRUPT_H

/*------------------------------------------------------------------------------*/
/* Function Prototype								*/
/*------------------------------------------------------------------------------*/
void int_cmt0(void);				// 姿勢制御用割り込み
void int_cmt1(void);				// センサー読み込み用割り込み
void int_cmt2(void);				// 1msタイマー用割り込み
void int_mot_r(void);				// 右モーターステップカウント割り込み
void int_mot_l(void);				// 左モーターステップカウント割り込み

#endif