/*==============================================================================*/
/* Battery Driver Header File							*/
/*==============================================================================*/
#ifndef _BATTERY_DRIVER_H
#define _BATTERY_DRIVER_H

/*------------------------------------------------------------------------------*/
/* Function Prototype								*/
/*------------------------------------------------------------------------------*/
unsigned short get_battery_volt(void);		// バッテリー電圧取得
void save_battery(unsigned short battery_volt);	// バッテリー電圧監視

#endif