/*==============================================================================*/
/* Sensor Driver C File								*/
/*==============================================================================*/

/*------------------------------------------------------------------------------*/
/* Include Files								*/
/*------------------------------------------------------------------------------*/
#include "interrupt.h"
#include "sensor_driver.h"

/*------------------------------------------------------------------------------*/
/* Global Variable								*/
/*------------------------------------------------------------------------------*/
t_sensor	sen_r;		// 右センサ構造体
t_sensor	sen_l;		// 左センサ構造体
t_sensor	sen_fr;		// 右前センサ構造体
t_sensor	sen_fl;		// 左前センサ構造体
t_control	con_wall;	// 制御構造体

/*------------------------------------------------------------------------------*/
/* Function Definitions								*/
/*------------------------------------------------------------------------------*/

/*==============================================================================*/
/* センサーパラメータ初期化		                                        */
/* 										*/
/* ---------------------------------------------------------------------------- */
/*  Arguments:		-						       	*/
/*  Return   :         	-							*/
/*==============================================================================*/
void init_sensor(void)
{	
	sen_r.ref = REF_SEN_R;			// 右センサのリファレンス値を初期化
	sen_l.ref = REF_SEN_L;			// 左センサのリファレンス値を初期化
	
	sen_r.th_wall = TH_SEN_R;		// 右センサの壁有無判断の閾値を初期化
	sen_l.th_wall = TH_SEN_L;		// 左センサの壁有無判断の閾値を初期化
	
	sen_fr.th_wall = TH_SEN_FR;		// 右前センサの壁有無判断の閾値を初期化
	sen_fl.th_wall = TH_SEN_FL;		// 左前センサの壁有無判断の閾値を初期化
	
	sen_r.th_control = CONTH_SEN_R;		// 右センサの壁制御かけるか否かの閾値を初期化
	sen_l.th_control = CONTH_SEN_L;		// 左センサの壁制御かけるか否かの閾値を初期化
	
	con_wall.kp = CON_WALL_KP;		// 壁比例制御の比例定数を初期化
	
	return;
}

/*==============================================================================*/
/* 物標距離取得		                                        		*/
/* 										*/
/* 指定されたセンサー種別の物標距離を取得する					*/
/* ---------------------------------------------------------------------------- */
/*  Arguments:		sensor_kind	センサー種別			       	*/
/*  Return   :         	distance	物標距離				*/
/*==============================================================================*/
int get_distance(int sensor_kind)
{
	int distance = 0;
	
	switch(sensor_kind)
	{
		case SENSOR_R:
			distance = sen_r.value;		// 右側物標距離
			break;
		case SENSOR_L:
			distance = sen_l.value;		// 左側物標距離	
			break;
		case SENSOR_FR:
			distance = sen_fr.value;	// 右前方物標距離
			break;
		case SENSOR_FL:
			distance = sen_fl.value;	// 左前方物標距離
			break;
		default:
			break;
	}
	
	return distance;
}

/*==============================================================================*/
/* PID制御有効化設定	                                        		*/
/* 										*/
/* ---------------------------------------------------------------------------- */
/*  Arguments:		-						       	*/
/*  Return   :         	-							*/
/*==============================================================================*/
void set_pid_enable(void)
{
	con_wall.enable = true;
	
	return;
}
/*==============================================================================*/
/* PID制御無効化設定	                                        		*/
/* 										*/
/* ---------------------------------------------------------------------------- */
/*  Arguments:		-						       	*/
/*  Return   :         	-							*/
/*==============================================================================*/
void set_pid_disable(void)
{
	con_wall.enable = false;
	
	return;
}