/*==============================================================================*/
/* Tire Control Header File							*/
/*==============================================================================*/
#ifndef _TIRE_CONTROL_H
#define _TIRE_CONTROL_H

/*------------------------------------------------------------------------------*/
/* Defines									*/
/*------------------------------------------------------------------------------*/
/* 旋回方向 */
#define TURN_RIGHT	(0)
#define TURN_LEFT	(1)

/* 駆動距離 */
#define HALF_SECTION	(90)	// 半区画の距離(mm)
#define SECTION		(180)	// 1区画の距離(mm)
#define TURN_90		(90)	// ターン角度90度
#define TURN_180	(180)	// ターン角度180度

/*------------------------------------------------------------------------------*/
/* Enum Definitions								*/
/*------------------------------------------------------------------------------*/
/* 走行モード */
enum RUN_MODE{
	Forward   = 0,	// 前進		北
	TurnRight = 1,	// 右旋回	東
	Reverse	  = 2,	// 180度旋回	南
	TurnLeft  = 3,	// 左旋回	西
	Stop      = 4	// 停止
};

/*------------------------------------------------------------------------------*/
/* Function Prototype								*/
/*------------------------------------------------------------------------------*/
void tire_control(void);					// タイヤ制御
void run_straight(int distance, float target_speed);		// タイヤ制御(直進)
void run_rotate(int rotate_direction, int rotate_angle);	// タイヤ制御(旋回)
void set_run_mode(enum RUN_MODE set_run_mode);			// 走行モード設定

#endif