/*==============================================================================*/
/* Maze Data Header File							*/
/*==============================================================================*/
#ifndef _MAZE_DATA_H
#define _MAZE_DATA_H

/*------------------------------------------------------------------------------*/
/* Struct Definitions								*/
/*------------------------------------------------------------------------------*/
/* 壁情報を格納する構造体(ビットフィールド) */
typedef struct
{
	unsigned char north	:2;	// 北の壁情報
	unsigned char east	:2;	// 東の壁情報
	unsigned char south	:2;	// 南の壁情報
	unsigned char west	:2;	// 西の壁情報
}st_wall;

/*------------------------------------------------------------------------------*/
/* Defines									*/
/*------------------------------------------------------------------------------*/
/* 迷路情報 */
#define MAZESIZE_X	(6)	// 迷路の大きさ(MAZESIZE_X * MAZESIZE_Y)迷路
#define MAZESIZE_Y	(6)	// 迷路の大きさ(MAZESIZE_X * MAZESIZE_Y)迷路

/* 壁情報 */
#define NO_WALL		(0)	// 壁がない場合の値
#define WALL		(1)	// 壁がある場合の値

/* ゴール座標 */
#define GOAL_X		(3)	// ゴール位置のX座標
#define GOAL_Y		(1)	// ゴール位置のY座標

/*------------------------------------------------------------------------------*/
/* Externs Variable								*/
/*------------------------------------------------------------------------------*/
extern const int goal_x;				// ゴール座標：X
extern const int goal_y;				// ゴール座標：Y
extern const st_wall wall_info[MAZESIZE_X][MAZESIZE_Y];	// 迷路の壁情報を格納する構造体配列

#endif