/*==============================================================================*/
/* Run Info Judgement Header File						*/
/*==============================================================================*/
#ifndef RUN_INFO_JUDGEMENT_H
#define RUN_INFO_JUDGEMENT_H

/*------------------------------------------------------------------------------*/
/* Enum Definitions								*/
/*------------------------------------------------------------------------------*/
/* 走行指示情報 */
typedef enum {
	Forward   = 0,	// 前進
	TurnRight = 1,	// 右旋回
	Reverse	  = 2,	// 180度旋回
	TurnLeft  = 3,	// 左旋回
	Stop      = 4,	// 停止
	Half      = 5,	// 0.5区画前進
} eRunInfoType;

/* 自車位置の向き(方角)を示す値 */
typedef enum
{
	North = 0,	// 北
	East  = 1,	// 東
	South = 2,	// 南
	West  = 3	// 西
} eDirectionType;

/*------------------------------------------------------------------------------*/
/* Externs Variable								*/
/*------------------------------------------------------------------------------*/
extern eRunInfoType run_info;		// 走行指示情報

/*------------------------------------------------------------------------------*/
/* Function Prototype								*/
/*------------------------------------------------------------------------------*/
void init_run_info_judgement(void);
void judgement_run_info(void); // 走行指示情報決定

#endif