/*==============================================================================*/
/* Run Info Judgement C File							*/
/*==============================================================================*/

/*------------------------------------------------------------------------------*/
/* Include Files								*/
/*------------------------------------------------------------------------------*/
#include "Application/Judgement/state_draw_map.h"
#include "Application/Judgement/state_calc_map.h"
#include "Application/Judgement/state_run_route.h"
#include "Application/Judgement/run_info_judgement.h"

/*------------------------------------------------------------------------------*/
/* Defines									*/
/*------------------------------------------------------------------------------*/
#define RUN_STATE_CALC_MAP		(1)	// 歩数マップ作成
#define RUN_STATE_RUN_ROUTE		(2)	// 経路走行

/*------------------------------------------------------------------------------*/
/* Global Variable								*/
/*------------------------------------------------------------------------------*/
eRunInfoType run_info;		// 走行指示情報

/*------------------------------------------------------------------------------*/
/* Variable                                                                     */
/*------------------------------------------------------------------------------*/
static int run_state;		// 動作状態

/*------------------------------------------------------------------------------*/
/* Function Definitions								*/
/*------------------------------------------------------------------------------*/

/*==============================================================================*/
/*  走行動作状態初期化								*/
/* ---------------------------------------------------------------------------- */
/*  入力:		-							*/
/*  出力:		-							*/
/*==============================================================================*/
void init_run_info_judgement(void)
{
	init_run_route();
	run_info = Stop;
	run_state = RUN_STATE_CALC_MAP;
	return;
}

/*==============================================================================*/
/*  走行指示情報決定								*/
/* 										*/
/*  進行方向を決定する								*/
/* ---------------------------------------------------------------------------- */
/*  入力:		-							*/
/*  出力:		run_info		走行指示情報			*/
/*==============================================================================*/
void judgement_run_info(void)
{
	// 現在の動作状態に応じて走行指示情報を設定
	switch (run_state)
	{
	case RUN_STATE_CALC_MAP:
		// 歩数マップ作成
		calc_map();
		run_info = Stop;
		// 歩数マップ作成は1回で完了するので、次の処理に移行
		run_state = RUN_STATE_RUN_ROUTE;
		break;

	case RUN_STATE_RUN_ROUTE:
		// 歩数マップをもとに経路走行
		run_route();
		run_info = route_run_info;
		break;

	default:
		run_info = Stop;
		break;
	}

	return;
}
