/*==============================================================================*/
/* State Run Route Header File							*/
/*==============================================================================*/
#ifndef STATE_RUN_ROUTE_H
#define STATE_RUN_ROUTE_H

#include "Application/Judgement/run_info_judgement.h"

/*------------------------------------------------------------------------------*/
/* Externs Variable								*/
/*------------------------------------------------------------------------------*/
extern eRunInfoType route_run_info;		// ç≈íZåoòHëñçséwé¶èÓïÒ

/*------------------------------------------------------------------------------*/
/* Function prototype								*/
/*------------------------------------------------------------------------------*/
void init_run_route(void);
void run_route(void);					// ç≈íZåoòHëñçs

#endif