/*==============================================================================*/
/* State Draw Map Header File							*/
/*==============================================================================*/
#ifndef STATE_DRAW_MAP_H
#define STATE_DRAW_MAP_H

/*------------------------------------------------------------------------------*/
/* Include Files								*/
/*------------------------------------------------------------------------------*/
#include "Application/Judgement/maze_setting.h"
#include "Application/Judgement/wall_exist_judgement.h"

/*------------------------------------------------------------------------------*/
/* Struct Definitions								*/
/*------------------------------------------------------------------------------*/
/* •Çî•ñ‚ğŠi”[‚·‚é\‘¢‘Ì */
typedef struct
{
	unsigned char north;	// –k‚Ì•Çî•ñ
	unsigned char east;	// “Œ‚Ì•Çî•ñ
	unsigned char south;	// “ì‚Ì•Çî•ñ
	unsigned char west;	// ¼‚Ì•Çî•ñ
} stWallType;

/*------------------------------------------------------------------------------*/
/* Externs Variable								*/
/*------------------------------------------------------------------------------*/
extern stWallType wall_info[MAZESIZE_X][MAZESIZE_Y];	// ƒ}ƒbƒv•Çî•ñ

#endif
